"""
Begin1. Дана сторона квадрата a. Найти его периметр P = 4·a.
Begin2. Дана сторона квадрата a. Найти его площадь S = a2.
Begin3. Даны стороны прямоугольника a и b. Найти его площадь S = a·b и
периметр P = 2·(a + b).
Begin4. Дан диаметр окружности d. Найти ее длину L = o·d. В качестве
значения o использовать 3.14.
Begin5. Дана длина ребра куба a. Найти объем куба V = a3 и площадь его
поверхности S = 6·a2.
Begin6. Даны длины ребер a, b, c прямоугольного параллелепипеда. Найти
его объем V = a·b·c и площадь поверхности S = 2·(a·b + b·c + a·c).
"""
# task1
# a = 10
# P = 4 * a
# print(P)


# task2
# a = 4
# S = a * a
# print(S)


# task 3
# a = 4
# b = 3
# S = a * b
# P = 2 * (a + b)
# print(S)
# print(P)

# task 4
# d = 3
# L = 3 * 3.14
# print(L)

# task 5
# a = 4
# V = a * a * a
# S = 6 * (a * a)
# print(V)
# print(S)

# task 6
# V = a·b·c и площадь поверхности S = 2·(a·b + b·c + a·c)
# a = 2
# b = 3
# c = 4
# V = a * b * c
# S = 2 * ((a * b) + (b * c) + (a * c))
# print(V)
# print(S)